In [1]:
import pandas as pd

In [2]:
df_logs = pd.read_csv('prod_activations_logs.csv', sep=';', parse_dates=True)

In [3]:
df_logs

     SUBS_ID  PROD_ID        START_DTTM          END_DTTM
1  id4651830     1954  20-03-2020 14:59  01-12-2020 00:00
5  id7646509     6431  19-03-2020 13:00  19-03-2020 13:03
2  id7461794     3310  20-03-2020 17:25  01-12-2020 00:00
3  id5416547     1743  17-03-2020 10:17  25-03-2020 11:00
4  id8238421     1859  01-03-2020 11:42  01-03-2020 11:43
3  id8641743     2752  20-03-2020 15:44  21-04-2020 15:44
2  id2185490     3210  16-03-2020 16:28  01-12-2020 00:00
6  id7642700     3020  15-03-2020 14:21  15-03-2020 23:42
2  id8741631     5677  19-03-2020 12:28  01-12-2020 00:00

In [7]:
#df_logs['START_DTTM'] = pd.to_datetime(df_logs['START_DTTM'], dayfirst=True)
df_logs['START_DTTM'] = pd.to_datetime(df_logs['START_DTTM'], format='%d-%m-%Y %H:%M')

In [8]:
#df_logs['END_DTTM'] = pd.to_datetime(df_logs['END_DTTM'], dayfirst=True)
df_logs['END_DTTM'] = pd.to_datetime(df_logs['END_DTTM'], format='%d-%m-%Y %H:%M')

In [9]:
df_tm_sales_1 = pd.read_csv('tm_sales_1.csv', sep=';', parse_dates=True)

In [10]:
df_tm_sales_1.head()

     SUBS_ID  FILIAL_ID  PROD_ID          ACT_DTTM
0  id4651830          1     1954  20-03-2020 14:59
1    7646509          5     6431  19-03-2020 13:00
2  id7412683          4     3313  22-03-2020 17:25

In [11]:
df_tm_sales_2 = pd.read_csv('tm_sales_2.csv', sep=';', parse_dates=True)

In [12]:
df_tm_sales_2.head()

   FILIAL_ID    SUBS_ID  PROD_ID          ACT_DTTM
0          3  id5416547     1743  17-03-2020 10:17
1          4        NaN     7421  12-03-2020 11:25
2          7    8362218     9879  05-03-2020 11:42
3          2    2185490     3210  16-03-2020 16:28

In [13]:
df_tm_sales_3 = pd.read_csv('tm_sales_3.csv', sep=';', parse_dates=True)
df_tm_sales_3.dtypes

FILIAL_ID     int64
PROD_ID       int64
SUBS_ID      object
ACT_DTTM     object
dtype: object

In [14]:
df_tm = pd.concat([df_tm_sales_1, df_tm_sales_2, df_tm_sales_3])

In [15]:
df_tm

     SUBS_ID  FILIAL_ID  PROD_ID          ACT_DTTM
0  id4651830          1     1954  20-03-2020 14:59
1    7646509          5     6431  19-03-2020 13:00
2  id7412683          4     3313  22-03-2020 17:25
0  id5416547          3     1743  17-03-2020 10:17
1        NaN          4     7421  12-03-2020 11:25
2    8362218          7     9879  05-03-2020 11:42
3    2185490          2     3210  16-03-2020 16:28
0  id5764122          3     1499  18-03-2020 15:44
1  id7642700          6     3020  15-03-2020 14:21
2  id1374509          2     5677  17-03-2020 11:48

In [16]:
df_tm = df_tm.dropna()

In [17]:
df_tm.dtypes

SUBS_ID      object
FILIAL_ID     int64
PROD_ID       int64
ACT_DTTM     object
dtype: object

In [18]:
#df_tm.SUBS_ID = df_tm.SUBS_ID.apply(lambda x: 'id' + x)
#df_tm.SUBS_ID

In [19]:
df_tm.SUBS_ID[-df_tm.SUBS_ID.str.startswith('id')] = 'id' + df_tm.loc[-df_tm.SUBS_ID.str.startswith('id')].SUBS_ID

<ipython-input-19-c4797c2d241b>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_tm.SUBS_ID[-df_tm.SUBS_ID.str.startswith('id')] = 'id' + df_tm.loc[-df_tm.SUBS_ID.str.startswith('id')].SUBS_ID
C:\Users\user\anaconda3\lib\site-packages\pandas\core\indexing.py:1732: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

In [20]:
df_tm

     SUBS_ID  FILIAL_ID  PROD_ID          ACT_DTTM
0  id4651830          1     1954  20-03-2020 14:59
1  id7646509          5     6431  19-03-2020 13:00
2  id7412683          4     3313  22-03-2020 17:25
0  id5416547          3     1743  17-03-2020 10:17
2  id8362218          7     9879  05-03-2020 11:42
3  id2185490          2     3210  16-03-2020 16:28
0  id5764122          3     1499  18-03-2020 15:44
1  id7642700          6     3020  15-03-2020 14:21
2  id1374509          2     5677  17-03-2020 11:48

In [21]:
#df_tm['ACT_DTTM'] = pd.to_datetime(df_tm['ACT_DTTM'], format='%d-%m-%Y')
df_tm['ACT_DTTM'] = pd.to_datetime(df_tm['ACT_DTTM'], dayfirst=False)

C:\Users\user\anaconda3\lib\site-packages\pandas\core\frame.py:3607: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._set_item(key, value)

In [22]:
df_tm.dtypes

SUBS_ID              object
FILIAL_ID             int64
PROD_ID               int64
ACT_DTTM     datetime64[ns]
dtype: object

In [23]:
df = df_logs.merge(df_tm, how='inner')

In [24]:
df

,SUBS_ID,PROD_ID,START_DTTM,END_DTTM,FILIAL_ID,ACT_DTTM
0,id4651830,1954,2020-03-20 14:59:00,2020-12-01 00:00:00,1,2020-03-20 14:59:00
1,id7646509,6431,2020-03-19 13:00:00,2020-03-19 13:03:00,5,2020-03-19 13:00:00
2,id5416547,1743,2020-03-17 10:17:00,2020-03-25 11:00:00,3,2020-03-17 10:17:00
3,id2185490,3210,2020-03-16 16:28:00,2020-12-01 00:00:00,2,2020-03-16 16:28:00
4,id7642700,3020,2020-03-15 14:21:00,2020-03-15 23:42:00,6,2020-03-15 14:21:00

In [25]:
df['difference'] = df.END_DTTM - df.START_DTTM
df

,SUBS_ID,PROD_ID,START_DTTM,END_DTTM,FILIAL_ID,ACT_DTTM,difference
0,id4651830,1954,2020-03-20 14:59:00,2020-12-01 00:00:00,1,2020-03-20 14:59:00,255 days 09:01:00
1,id7646509,6431,2020-03-19 13:00:00,2020-03-19 13:03:00,5,2020-03-19 13:00:00,0 days 00:03:00
2,id5416547,1743,2020-03-17 10:17:00,2020-03-25 11:00:00,3,2020-03-17 10:17:00,8 days 00:43:00
3,id2185490,3210,2020-03-16 16:28:00,2020-12-01 00:00:00,2,2020-03-16 16:28:00,259 days 07:32:00
4,id7642700,3020,2020-03-15 14:21:00,2020-03-15 23:42:00,6,2020-03-15 14:21:00,0 days 09:21:00

In [26]:
df[df.difference > '5m'].sort_values('SUBS_ID')['SUBS_ID'].to_list()

['id2185490', 'id4651830', 'id5416547', 'id7642700']

In [27]:
df = df[df.difference > '5m'].sort_values('SUBS_ID')

In [28]:
df

,SUBS_ID,PROD_ID,START_DTTM,END_DTTM,FILIAL_ID,ACT_DTTM,difference
3,id2185490,3210,2020-03-16 16:28:00,2020-12-01 00:00:00,2,2020-03-16 16:28:00,259 days 07:32:00
0,id4651830,1954,2020-03-20 14:59:00,2020-12-01 00:00:00,1,2020-03-20 14:59:00,255 days 09:01:00
2,id5416547,1743,2020-03-17 10:17:00,2020-03-25 11:00:00,3,2020-03-17 10:17:00,8 days 00:43:00
4,id7642700,3020,2020-03-15 14:21:00,2020-03-15 23:42:00,6,2020-03-15 14:21:00,0 days 09:21:00

In [29]:
df.to_csv('data', sep=',')